In [1]:
import sqlite3

# Kết nối hoặc tạo database SQLite
conn = sqlite3.connect("university.db")
cursor = conn.cursor()

In [4]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS course (
    course_id INTEGER PRIMARY KEY,
    course_name TEXT NOT NULL
);
""")
conn.commit()

In [5]:
cursor.executemany("""
INSERT INTO course (course_id, course_name) VALUES (?, ?)
""", [
    (12, 'Giai tich'),
    (34, 'Thong ke'),
    (26, 'Tin hoc')
])
conn.commit()

In [6]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS student (
    student_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    class TEXT NOT NULL,
    course_id INTEGER,
    score REAL,
    FOREIGN KEY (course_id) REFERENCES course(course_id)
);
""")
conn.commit()

In [ ]:
cursor.executemany("""
INSERT INTO student (student_id, name, class, course_id, score) VALUES (?, ?, ?, ?, ?)
""", [
    (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
    (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
    (3, 'Pham Van Nam', 'Toan Tin', None, 7.9),
    (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2), 
    (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0),
    (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5),
    (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
    (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8),
    (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2),
    (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)
])
conn.commit()

 1. Kết nối hai bảng Student và Course

In [ ]:
# Tích Decartes
cursor.execute(''' SELECT * FROM Student, Course;''')
conn.commit()
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc'),
 (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong ke'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai tich'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong ke'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai tich'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong ke'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 12, 'Giai tich'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 26, 'Tin hoc'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 34, 'Thong ke'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai tich'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin hoc'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai tich'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai tich'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong ke'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 12, 'Giai tich'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 26, 'Tin hoc'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 34, 'Thong ke'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai tich'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong ke')]

In [5]:
#INNER JOIN
cursor.execute(''' SELECT * FROM Student INNER JOIN Course ON Student.course_id = Course.course_id;''')
conn.commit()
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')]

In [6]:
#LEFT JOIN
cursor.execute(''' SELECT * FROM Student LEFT JOIN Course ON Student.course_id = Course.course_id;''')
conn.commit()
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None)]

In [7]:
#RIGHT JOIN
cursor.execute(''' SELECT * FROM Student RIGHT JOIN Course ON Student.course_id = Course.course_id;''')
conn.commit()
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (None, None, None, None, None, 26, 'Tin hoc')]

In [8]:
# FULL OUTER JOIN
cursor.execute(''' SELECT * FROM Student FULL OUTER JOIN Course ON Student.course_id = Course.course_id;''')
conn.commit()
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None),
 (None, None, None, None, None, 26, 'Tin hoc')]

2. Cập nhật course_id trong bảng student và thống kê

In [17]:
# Cập nhật course_id từ bảng course
cursor.execute(''' UPDATE Student SET course_id = 12 WHERE course_id IS NULL;''')
conn.commit()

In [ ]:
# Xóa sinh viên có course_id không tồn tại
cursor.execute(''' DELETE FROM Student WHERE course_id NOT IN (SELECT course_id FROM Course);''')
conn.commit()

In [22]:
#Tổng số sinh viên và điểm trung bình theo từng lớp
cursor.execute(''' SELECT class, COUNT(*) AS total_students, ROUND(AVG(score), 2) AS avg_score
FROM Student
GROUP BY class;''')
conn.commit()
cursor.fetchall()

[('Kinh Te', 3, 8.53), ('May Tinh', 2, 6.85), ('Toan Tin', 1, 7.9)]

In [31]:
#Tổng số sinh viên và điểm trung bình theo từng môn học
cursor.execute(''' SELECT course.course_name, 
                    COUNT(*) AS total_students, 
                    AVG(student.score) AS avg_score
FROM student
JOIN course ON student.course_id = course.course_id
GROUP BY course.course_name;''')
conn.commit()
cursor.fetchall()

[('Giai tich', 4, 7.2), ('Thong ke', 2, 9.2)]

In [20]:
#Phân loại thi đua theo số điểm của từng môn học
cursor.execute(''' SELECT course_name,
        CASE 
        WHEN AVG(score) > 9.0 THEN 'Xuất sắc'
        WHEN AVG(score) BETWEEN 6.0 AND 8.9 THEN 'Tốt'
        ELSE 'Kém'
    END AS performance_class
FROM student
JOIN course ON student.course_id = course.course_id
GROUP BY course_name;''')
conn.commit()
cursor.fetchall()

[('Giai tich', 'Tốt'), ('Thong ke', 'Xuất sắc')]

3. Xếp hạng sinh viên

In [ ]:
#Theo điểm số (Hiển thị top 3 sinh viên có điểm số cao nhất và thấp nhất)
cursor.execute(''' SELECT name, score, DENSE_RANK() OVER (ORDER BY score DESC) AS rank
FROM Student;''')
conn.commit()
cursor.fetchall()

[('Tran Thi Lan', 9.2, 1),
 ('Bui Tien Dung', 9.2, 1),
 ('Pham Van Nam', 7.9, 2),
 ('Duong Huu Phuc', 7.2, 3),
 ('Cao Thi Hanh', 7.0, 4),
 ('Nguyen Minh Hoang', 6.7, 5)]

In [ ]:
#Theo lớp học (Hiển thị top 3 sinh viên có điểm số cao nhất và thấp nhất)
cursor.execute(''' SELECT name, class, score, DENSE_RANK() OVER (PARTITION BY class ORDER BY score DESC) AS rank
FROM Student;''')
conn.commit()
cursor.fetchall()

[('Tran Thi Lan', 'Kinh Te', 9.2, 1),
 ('Bui Tien Dung', 'Kinh Te', 9.2, 1),
 ('Duong Huu Phuc', 'Kinh Te', 7.2, 2),
 ('Cao Thi Hanh', 'May Tinh', 7.0, 1),
 ('Nguyen Minh Hoang', 'May Tinh', 6.7, 2),
 ('Pham Van Nam', 'Toan Tin', 7.9, 1)]

In [37]:
#Theo môn học (Hiển thị top 3 sinh viên có điểm số cao nhất và thấp nhất)
cursor.execute(''' SELECT name, course_name, score, DENSE_RANK() OVER (PARTITION BY course_name ORDER BY score DESC) AS rank
FROM Student
JOIN Course ON Student.course_id = Course.course_id;''')
conn.commit()
cursor.fetchall()

[('Pham Van Nam', 'Giai tich', 7.9, 1),
 ('Duong Huu Phuc', 'Giai tich', 7.2, 2),
 ('Cao Thi Hanh', 'Giai tich', 7.0, 3),
 ('Nguyen Minh Hoang', 'Giai tich', 6.7, 4),
 ('Tran Thi Lan', 'Thong ke', 9.2, 1),
 ('Bui Tien Dung', 'Thong ke', 9.2, 1)]

4. Thêm trường graduation_date

In [39]:
# thêm graduation_date
cursor.execute('''ALTER TABLE Student ADD graduation_date DATETIME;''')
conn.commit()

# Tạo một bảng tạm thời với rankrank của sinh viên
cursor.execute('''
CREATE TEMP TABLE StudentRanks AS
SELECT student_id, DENSE_RANK() OVER (ORDER BY score DESC) AS rank
FROM Student;
''')
conn.commit()

# Update graduation_date dựa trên rank
cursor.execute('''
UPDATE Student
SET graduation_date = DATE('now', '+' || (SELECT rank FROM StudentRanks WHERE Student.student_id = StudentRanks.student_id) || ' years');
''')
conn.commit()

cursor.execute('SELECT * FROM Student;')
cursor.fetchall()

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, '2030-03-12'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, '2026-03-12'),
 (3, 'Pham Van Nam', 'Toan Tin', 12, 7.9, '2027-03-12'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, '2026-03-12'),
 (9, 'Duong Huu Phuc', 'Kinh Te', 12, 7.2, '2028-03-12'),
 (10, 'Cao Thi Hanh', 'May Tinh', 12, 7.0, '2029-03-12')]